class Colors:
    green = '\033[38;05;82m'
    red = '\033[38;05;197m'
    yellow = '\033[01;38;05;222m'
    default = '\033[0m'


class Emotion:
    action = '(ง •̀ゝ•́)ง'
    confuse = '(ง ಥ_ಥ)ง'
    dead = '(ง ✘_✘)ง'
    winner = '(ᕙ •̀ᗜ•́)ᕗ'


class CellType:
    empty_room = '  '
    wall = '🧱'
    enemy = '⚔️'
    dead_enemy = '💀'
    player = '👣'
    item = '💎'
    start = '⏩'
    end = '⏪'


class DefaultAnimation:
    loader = [
        '[Загрузка] _____________________[0/100%]',
        '[Загрузка] ███__________________[17/100%]',
        '[Загрузка] █████████____________[35/100%]',
        '[Загрузка] ████████████_________[51/100%]',
        '[Загрузка] █████████████████____[80/100%]',
        '[Загрузка] █████████████████████[100/100%]',
    ]